SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61994

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_K4_61994.s )
Size  ( 2.76139m 4.03936m 11.0m )
Mass ( 68.4t-uk )
WheelRadius ( 19in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 0cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 209kN )   Comment (* braked at 70% of mass on driving wheels 65.5t, coefficient of friction 0.5 *)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)
MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )
MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.9m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 6172 )
ORTSDavis_B ( 22.87 )
ORTSDavis_C ( 5.289 )

ORTSWagonFrontalArea (99)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 4
Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( -0.55 3.25 -4.15 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.5 )
     )
    )
   )
Light	(
   comment( Glowing Firebox )
   Type		( 0 )
   Conditions	(
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn	( 0.5 )
   FadeOut	( 0.5 )
   Cycle	( 0 )
   States	(	2
   State	(
   Duration ( 0.5 )
   LightColour ( eeff8800 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.0 )
   )
   State	(
   Duration ( 0.3 )
   LightColour ( ffff8855 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.05 )
	  )
      )
   )
Light (
   comment( Head light Position B )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( 0.85 1.425 4.93 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.01 )
    LightColour ( eeffffff )
    Position ( 0.85 1.425 4.93 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
Light (
   comment( Head light Position D )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.05 )
    FadeOut ( 0.05 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( -0.88 1.425 4.93 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.1 )
    LightColour ( eeffffff )
    Position ( -0.88 1.425 4.93 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
 )
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_K4_61994.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.7 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17eng.sms" )
)

Engine ( OR-61994

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.0 3.805 -3.55
				0 1 0
				0.11
			)
			SafetyValvesFX
			(
				0 3.752 -3
				0 1 0
				0.35
			)
			StackFX
			(
				0 3.984 2.99
				0 1 0
				0.3
			)
			StackFX
			(
				0 3.984 2.99
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)
			
			Injectors2FX
			(
				-1.1 1.1 -4.9
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.1 1.1 -4.9
				0 -1 0
				0.11
			)
      		Comment ( == Cylinder - Right == )
			CylindersFX
			(
				-1.083 0.45 3.2
				0 0 1
				0.12
			)
			Comment ( == Cylinder - Right == )
			CylindersFX
			(
				-1.083 0.45 2.5
				0 0 1
				0.12
			)

      		Comment ( == Cylinder - Left == )
			CylindersFX
			(
				1.083 0.45 3.2
				0 0 1
				0.12
			)
      		Comment ( == Cylinder - Left == )
			CylindersFX
			(
				1.083 0.45 2.5
				0 0 1
				0.12
			)

		)
	)

Wagon ( OR-61994 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 31in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 59.55t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 188ft^3 )  
ORTSEvaporationArea ( 1421.6ft^2 )
ORTSSuperheatArea ( 310ft^2 )
MaxBoilerPressure ( 200psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 18.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 27.5ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 6t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )


Comment(ORTSMaxIndicatedHorsepower ( 1105.0hp ))   

Comment(ORTSMaxSuperheatTemperature ( 275.0 ))   
Comment(From report, not normlly used from Jan 2022)

ORTSBoilerEfficiency( 0.0 0.92  170.0 0.46 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector( 0 1 0.1 0.55 )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( K3.cvf )
HeadOut (  -1.423 3.0 -3.7 )
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17cab.sms" )
Name ( "61994 K4, THE GREAT MARQUESS, Express Passenger, TE 36.6Klbf" )
Description (
"The North British Railway (NBR) West Highland line to Mallaig via Fort William presented many operating problems due to its steep gradients and severe curves, combined with very restrictive axle loading limits. At Grouping in 1923,passenger services were being hauled by D34 'Glen' 4-4-0s due to the axle loading restrictions. Heavier stock had already entered service, and was already resulting in some double-heading of the D34s. An early proposal was to use the new K3s to provide extra power, but they would have been restricted from the Mallaig section of the line, and was vetoed completely by the Civil Engineer after K3 bridge tests were made.
K4, No. 3441 Loch Long entered service on 28th January 1937 and was virtually identical to a July 1936 outline. The final factor of adhesion was 3.94 due to a slightly heavier locomotive weight, adhesive weight, and axle loading. The new locomotive quickly showed itself capable of hauling 300 ton loads to Fort William without assistance, but the boiler pressure was increased to 200psi in June 1937 to enhance uphill speeds. This resulted in a tractive effort of 36,599 lb, with a corresponding reduction in the factor of adhesion to 3.54.
Initially the K4s were mainly used on the Glasgow to Fort William stretch of the West Highland line. They handled the gradients and continuous curves with ease, but they were not designed for the 20 miles of level track near Glasgow, and the 8.5 miles stretch alongside Loch Eil. Vibration at speed was a problem on these stretches, and the middle big-end would require regular nut tightening. On one occasion, the middle connecting rod actually dropped off! Hence maintenance costs increased. The V4s with their slightly larger wheels were more popular with the enginemen but were lacking in power. Eventually the Thompson B1s appeared on the Glasgow to Fort William services from 1947, displacing the K4s to the Mallaig stretch. The new Thompson/Peppercorn K1s appeared in 1949 and were preferable due to their lack of a troublesome middle big-end. After Nationalisation, LMS 'Black 5' 4-6-0s were also moved to the line. From this point onwards, the K4s were concentrated at Eastfield and intended for use on West Highland goods trains only.
In 1959, the five K4s were transferred to Thornton Shed for use on goods trains until October 1961 when four were withdrawn. The last K4, No. 61994 The Great Marquess, was withdrawn in December 1961 and sold to Viscount Garnock and has survived into preservation."
)
)